Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: undef *xyz; # destroys $xyz, @xyz, %xyz, &xyz, etc.
es_es: undef *xyz; # destruye $xyz, @xyz, %xyz, &xyz, etc.

source: The padding spaces would appear after the newline, which is probably not what you had in mind.
es_es: Pueden aparecer espacios de relleno después del avance de línea, que probablemente no es lo que tenía en mente.

source: You'll have to put a C<local $_;> before the loop if you want that to happen.
es_es: Tendrá que poner un C<local $_;> antes del bucle si quiere que sea así.

source: To be safe, you may need to set C<$|> ($AUTOFLUSH in English) or call the C<autoflush()> method of C<IO::Handle> on any open handles to avoid duplicate output.
es_es: Para estar seguros, puede necesitar poner C<$|> ($AUTOFLUSH en English) o llamar el método C<autoflush()> de C<IO::Handle> en cualquiera de los identificadores de archivo abiertos para evitar duplicación de salida.

source: With version objects, we need them to use MODULE VERSION syntax.
es_es: Con los objetos de versión, les necesitamos para usar la sintaxis MÓDULO VERSIÓN.

source: EXISTS this, key
es_es: EXISTS este, clave

source: [the list of failures being compiled]
es_es: [La lista de fracasos que han sido recopilados]

source: space prefix non-negative number with a space
es_es: espacio prefija un número no negativo con un espacio

source: It does not protect against symbolic links in the file's path.
es_es: No protege contra enlaces simbólicos en la ruta del archivo.

source: printf '<%.6x>', 1; # prints "<000001>"
es_es: printf '<%.6x>', 1; # imprime "<000001>"

source: next OUTER if $wid > $jet;
es_es: next EXTERNO if $wid > $jet;

source: Shell wildcards, pipes, and redirections will be honored.
es_es: Los comodines del intérprete, tuberías y redirecciones serán respetados.

source: print scalar reverse; # Hello, world
es_es: print scalar reverse; # Hola, mundo

source: Returns the undefined value if the context is looking for no value (void context).
es_es: Devuelve el valor indefinido si el contexto está buscando por ningún valor (contexto void).

source: Make sure that CLASSNAME is a true value.
es_es: Asegúrese de que NOMBRECLASE es un valor verdadero.

source: if ($condition && ...) { say "Hello" }
es_es: if ($condicion && ...) { say "Hola" }

source: return 0 unless @a == @b; # same len?
es_es: return 0 unless @a == @b; # ¿misma longitud?

source: say $+ {a}; # Prints '12'
es_es: say $+ {a}; # Imprime '12'

source: Read the F<INSTALL> file, which is part of the source distribution.
es_es: Lea el archivo F<INSTALL> incluido en la distribución de código fuente.

source: is merely equivalent to
es_es: es equivalente a

source: Use C<die> instead, which can be trapped by an C<eval>.
es_es: Use en su lugar C<die>, que puede ser atrapado por un C<eval>.

source: Mentioning a subroutine name for exists or defined does not count as declaring it.
es_es: Mencionar el nombre de una subrutina para saber si existe o está definida no cuenta como si fuera su declaración.

source: (Language historians will also note some vestiges of B<csh>, Pascal, and even BASIC-PLUS.) Expression syntax corresponds closely to C expression syntax.
es_es: (los historiadores de los lenguajes también destacarán algunos vestigio de B<csh>, Pascal e incluso BASIC-PLUS). La sintaxis de expresiones es muy parecida a la de C.

source: If EXPR is undefined, returns C<undef>.
es_es: Si EXPR es indefinido, devuelve C<undef>.

source: After all, in your journey as a programmer, you are likely to encounter different styles.
es_es: Al fin y al cabo, en su vida profesional como programador se va a encontrar distintos estilos.

source: The use of hash keys starting with a hyphen (C<-name>) or entirely in upper case (C<NAME>) is a relic of older versions of Perl in which ordinary lower case strings were not handled correctly by the C<=E<gt>> operator.
es_es: El uso de claves hash comenzando con un guión (C<-name>) o totalmente en mayúsculas (C<NOMBRE>) es una reliquia de las versiones anteriores de Perl en el que las cadenas en minúscula no se manejaban correctamente por el operador C<=E<gt>>.

source: If you I<really> want to follow an C<exec> with some other statement, you can use one of these styles to avoid the warning:
es_es: Si I<verdaderamente> quiere continuar un C<exec> con otra instrucción, puede usar algunas de estas formas para evitar el aviso:

source: It's important to set a few things straight first.
es_es: Para empezar es importante aclarar algunas ideas.

source: my $tail = substr $s, -4; # tree
es_es: my $tail = substr $s, -5; # verde

source: =item the replacement of C<s///>
es_es: =item el reemplazo de C<s///>

source: There are no changes incompatible with 5.8.2.
es_es: No hay cambios incompatibles con 5.8.2.

source: # short 12, two zero bytes padding, long 34
es_es: # un 12 short, dos bytes cero de relleno, un 34 long

source: =item my TYPE EXPR
es_es: =item my TIPO EXPR

source: In other words: regardless of platform, use binmode() on binary data, like images, for example.
es_es: En otras palabras: indiferentemente de la plataforma, use binmode() en datos binarios, como por ejemplo imágenes.

source: =head2 C-style Logical Defined-Or X<//> X<operator, logical, defined-or>
es_es: =head2 Defined-Or lógico al estilo del C X<//> X<operator, logical, defined-or> X<operador, lógico, defined-or>

source: Using this operator can lead to programs that are difficult to port, because the shell commands called vary between systems, and may in fact not be present at all.
es_es: Usando este operador puede dar lugar a programas que son difíciles de portar, porque el shell de comandos varían entre sistemas, y de hecho no pueden estar presentes en todos.

source: A rare access violation at Perl start-up could occur if the Perl image was installed with privileges or if there was an identifier with the subsystem attribute set in the process's rightslist.
es_es: Una violación de acceso poco frecuente en la puesta en marcha de Perl podría producirse si la imagen de Perl se instaló con privilegios o si hubo un identificador con el conjunto de atributos del subsistema en la lista de derechos del proceso.

source: [aeiou] matches a single character in the given set
es_es: [aeiou] un solo carácter del conjunto especificado

source: Or you can continue to use the L<fields> pragma, but please don't expect the data structures to be pseudohashes any more.
es_es: O bien, puede seguir utilizando el pragma L<fields> pero, por favor, no permita que las estructuras de datos sigan siendo pseudo-hashes.

source: =head2 Subscripts of slices
es_es: =head2 Subíndices de porciones

source: C<GDBM_File> upgraded to version 1.08
es_es: C<GDBM_File> actualizado a la versión 1.08

source: perlxstut Perl XS tutorial
es_es: perlxstut Tutorial de XS

source: There are no changes incompatible with 5.8.5.
es_es: No hay cambios incompatibles con 5.8.5.

source: For example, on the ancient Macs (pre-MacOS X) of yesteryear, these used to be reversed, and on systems without line terminator, printing C<"\n"> might emit no actual data.
es_es: Por ejemplo, en los antiguos Mac (pre MacOS X) de antaño, estos solían estar invertidos, y en los sistemas sin terminador de línea, la impresión de un C<"\n"> puede no emitir ningún dato.

source: =item getnetbyname NAME
es_es: =item getnetbyname NOMBRE

source: update to Unicode 3.1.1
es_es: actualización a Unicode 3.1.1

source: =head1 QUICK CHECKLIST
es_es: =head1 RESUMEN LISTA DE CONTROL

source: # bytes because the U at the start of the format caused a switch to
es_es: # porque la U al principio del formato causó un cambio a

source: perl588delta Perl changes in version 5.8.8
es_es: perl588delta Cambios en la versión 5.8.8

source: [^aeiou] matches a single character outside the given set
es_es: [^aeiou] un solo carácter no perteneciente al conjunto especificado

source: A categorized list of modules is also available from CPAN.
es_es: En CPAN también está disponible una lista de módulos clasificados por categorías.

source: ++ Match 1 or more times and give nothing back
es_es: ++ Coincide 1 o más veces y no devuelve nada

source: F<h2xs> converts C header files into XS modules, and will try and write as much glue between C libraries and Perl modules as it can.
es_es: F<h2xs> convierte archivos de encabezado de C en módulos XS y agrega gran parte del código necesario para la comunicación entre bibliotecas C y módulos Perl.

source: my $end = substr $s, 14; # climbed the green tree
es_es: my $end = substr $s, 14; # subió el árbol verde

source: See L<perlvar/@INC> and L<perlvar/%INC> for these variables.
es_es: Ver L<perlvar/@INC> y L<perlvar/%INC> por estas variables.

source: 0 0..3 "fred" "barney" "wilma" "betty"
es_es: 0 0..3 "pedro" "pablo" "wilma" "betty"

source: F<enc2xs> builds a Perl extension for use by Encode from either Unicode Character Mapping files (.ucm) or Tcl Encoding Files (.enc).
es_es: F<enc2xs> genera una extensión Perl para Encode a partir de archivos de asignación de caracteres Unicode (.ucm) o de archivos de codificación Tcl (.enc).

source: Return your results in the most generic form possible and allow the user to choose how to use them.
es_es: Muestre los resultados en su forma más genérica posible y permita al usuario elegir la forma de utilizarlos.

source: (In a script passed to Perl via B<-e> switches, each B<-e> is counted as one line.)
es_es: (En un script pasado a Perl a través de modificadores B<-e>, cada B<-e> cuenta como una línea.)

source: Regex Array array grep grep /$a/, @$b
es_es: Regex Array grep array grep /$a/, @$b

source: Hash CodeRef sub truth for each key[1] !grep { !$b->($_) } keys %$a
es_es: Hash RefCódigo sub verdad por cada clave[1] !grep { !$b->($_) } keys %$a

source: printf '<%.5s>', "truncated"; # prints "<trunc>"
es_es: printf '<%.5s>', "truncado"; # imprime "<trunc>"

source: Read all about them in L<perlrequick>, L<perlretut>, and L<perlre>.
es_es: Encontrará más información en L<perlrequick>, L<perlretut> y L<perlre>.

source: Forcing big- or little-endian byte-order on floating-point values for data exchange can work only if all platforms use the same binary representation such as IEEE floating-point.
es_es: Forzar una ordenación de bytes en valores de punto flotante para el intercambio de datos sólo puede funcionar si todas las plataformas utilizan la misma representación binaria de punto flotante IEEE.

source: Failed 3/811 test scripts, 99.63% okay.
es_es: Fallaron 3/811 de las pruebas, 99,63% bien.

source: In all of these examples, Perl will assume you meant defined-or.
es_es: En todos estos ejemplos, Perl asumirá que significaba definido-o.

source: The return list's length always matches that of the argument list: deleting non-existent elements returns the undefined value in their corresponding positions.
es_es: La longitud de la lista devuelta siempre coincide con el de la lista de argumentos: eliminar elementos no existentes devuelve el valor indefinido en sus posiciones correspondientes.

source: || die "can't open < $ARGV[0]: $!";
es_es: || die "no puedo abrir < $ARGV[0]: $!";

source: Another useful shortcut is that, if you use a literal array or hash as the argument to C<given>, it is turned into a reference.
es_es: Otro método abreviado útil es que, si usa un array o hash literal, como el argumento a C<given>, se convierte en una referencia.

source: The C<foreach> loop iterates over a normal list value and sets the variable VAR to be each element of the list in turn.
es_es: El bucle C<foreach> itera sobre los valores de una lista normal y pone la variable VAR a cada uno de los elementos de la lista.

source: See also L<AnyDBM_File> for a more general description of the pros and cons of the various dbm approaches, as well as L<DB_File> for a particularly rich implementation.
es_es: Ver también L<AnyDBM_File> para una descripción más general de los pros y contras de las distintas formas dbm, así como L<DB_File> para ver una implementación particularmente rica.

source: perl56delta Perl changes in version 5.6
es_es: perl56delta Cambios en la versión 5.6

source: v An unsigned short (16-bit) in "VAX" (little-endian) order.
es_es: v Un corto sin signo (16 bit) en orden "VAX" (little-endian).

source: If EXPR is omitted, C<$_> is used.
es_es: Si la EXPR se omite, se usa C<$_>.

source: You should contact modules@perl.org to ask them about your module name before publishing your module.
es_es: Debería ponerse en contacto con modules@perl.org para preguntarles acerca del nombre de su módulo antes de publicarlo.

source: =item sysseek FILEHANDLE,POSITION,WHENCE X<sysseek> X<lseek>
es_es: =item sysseek IDENTIFICADOR_ARCHIVO,POSICIÓN,DÓNDE X<sysseek> X<lseek>

source: If an empty list, C<undef>, or nothing that matches the first 3 values above is returned, then C<require> looks at the remaining elements of @INC.
es_es: Si se devuelve una lista vacía, C<undef>, o nada que coincida con los tres primeros valores anteriores, entonces C<require> mira en los elementos restantes de @INC.

source: perl585delta Perl changes in version 5.8.5
es_es: perl585delta Cambios en la versión 5.8.5

source: If the starting delimiter is an unpaired character like C</> or a closing punctuation, the ending delimiter is same as the starting delimiter.
es_es: Si el delimitador de partida es un carácter no emparejado, como C</> o un carácter de puntuación de cierre, el delimitador de cierre es el mismo que el delimitador de inicio.

source: Here's a simple but sufficient example:
es_es: Aquí hay un simple pero útil ejemplo:

source: Unlike Perl 4, Perl 5 treats backticks as normal delimiters; the replacement text is not evaluated as a command.
es_es: A diferencia de Perl 4, Perl 5 trata las comillas simples invertidas como delimitadores normales; el texto de reemplazo no es evaluado como un comando.

source: In scalar context, C<times> returns C<$user>.
es_es: En contexto escalar, C<times> devuelve C<$usuario>.

source: Documented -X overloading.
es_es: Documentada la sobrecarga de -X.

source: As this can lead to unexpected results, it is best to specify which other rule set should be used.
es_es: Ya que esto puede conducir a resultados inesperados, lo mejor es especificar qué conjunto de reglas se deben usar.

source: =head2 Trying to do too much
es_es: =head2 Tratar de hacer demasiado

source: If FILEHANDLE is unspecified, output goes to the current default output channel, which starts out as STDOUT but may be changed by the C<select> operator.
es_es: Si IDENTIFICADOR_ARCHIVO no está especificado, la salida va al canal predeterminado de salida actual, que suele ser STDOUT, pero puede ser modificado por el operador C<select>.

source: An unquoted identifier works like double quotes.
es_es: Un identificador sin comillas funciona igual que las comillas dobles.

source: Perl 5 now has a switch statement.
es_es: Perl 5 ahora tiene una instrucción switch.

source: =item tell FILEHANDLE X<tell>
es_es: =item tell IDENTIFICADOR_ARCHIVO X<tell>

source: Similar to C<(R1)>, this predicate checks to see if we're executing directly inside of the leftmost group with a given name (this is the same logic used by C<(?&NAME)> to disambiguate).
es_es: Al igual que C<(R1)>, este predicado comprueba si estamos ejecutando directamente dentro del grupo nominado más a la izquierda (esta es la misma lógica usada por C<(?&NOMBRE)> para eliminar la ambigüedad).

source: This distinction is determined on syntactic grounds alone.
es_es: Esta distinción está determinada sólo por razones sintácticas.

source: The Perl core has an extensive test suite.
es_es: Existe un completo conjunto de pruebas del núcleo de Perl.

source: native floating_point --> native integer (*)
es_es: punto flotante nativo --> entero nativo (*)

source: printf '<% +d>', 12; # prints "<+12>"
es_es: printf '<% +d>', 12; # imprime "<+12>"

source: %F a synonym for %f
es_es: %F un sinónimo para %f

source: To disable the hash randomisation in runtime, set the environment variable PERL_HASH_SEED to 0 (zero) before running Perl (for more information see L<perlrun/PERL_HASH_SEED>), or to disable the feature completely in compile time, compile with C<-DNO_HASH_SEED> (see F<INSTALL>).
es_es: Para desactivar la asignación al azar de un hash en tiempo de ejecución, ponga la variable de entorno PERL_HASH_SEED a 0 (cero) antes de ejecutar Perl (para más información véase L<perlrun/PERL_HASH_SEED>), o para desactivar la función completamente en tiempo de compilación, compilar con C<-DNO_HASH_SEED> (vea F<INSTALL>).

source: F<c2ph> and F<pstruct>, which are actually the same program but behave differently depending on how they are called, provide another way of getting at C with Perl - they'll convert C structures and union declarations to Perl code.
es_es: F<c2ph> y F<pstruct> son en realidad el mismo programa, pero se comportan de manera distinta en función de cómo se invoquen. Proporcionan otra manera de incorporar código C en Perl: convierten declaraciones de estructuras y uniones de C en código Perl.

source: This form is typically used to trap exceptions more efficiently than the first (see below), while also providing the benefit of checking the code within BLOCK at compile time.
es_es: Esta forma es típicamente usada para atrapar excepciones más eficientemente que la primera forma (ver arriba), mientras que también provee del beneficio de comprobar el código dentro del BLOQUE en tiempo de compilación.

source: It transpired that although the implementation introduced in 5.8.1 was source compatible with 5.8.0, it was not binary compatible in certain cases.
es_es: Se constató que, aunque la implementación fue introducida en 5.8.1, compatible a nivel de código fuente con 5.8.0, no era compatible a nivel binario, en ciertos casos.

source: The result of overflowing the range of the integers is undefined because it is undefined also in C. In other words, using 32-bit integers, C<< 1 << 32 >> is undefined.
es_es: El resultado del desbordamiento del rango de los números enteros no está definido, ya que tampoco está definido en C. En otras palabras, usando enteros de 32 bits, C<< 1 << 32 >> no está definido.

source: There's also a negated version, for the same reason we have C<unless>:
es_es: Existe también una versión negada, por la misma razón que existe C<unless>:

source: SCALAR will be grown or shrunk so that the last byte actually read is the last byte of the scalar after the read.
es_es: ESCALAR crecerá o se reducirá de manera que el último byte leído sea el último byte del escalar después de la lectura.

source: However, only double quotes "interpolate" variables and special characters such as newlines (C<\n>):
es_es: Sin embargo las variables y los caracteres especiales, como los caracteres de nueva línea (C<\n>), solo se "interpolan" con comillas dobles:

source: The short-circuit behavior is identical.
es_es: El comportamiento abreviado es idéntico.

source: print hex 'aF'; # same
es_es: print hex 'aF'; # lo mismo

source: The error, if any, is still returned in C<$@>.
es_es: El error, si está, es devuelto en C<$@>.

source: The only difference between them is the place that the filter is installed.
es_es: La única diferencia entre ellos es el lugar en el que se instala el filtro.

source: Capture group contents are dynamically scoped and available to you outside the pattern until the end of the enclosing block or until the next successful match, whichever comes first.
es_es: Los contenidos del grupo de captura están, dinámicamente, ajustados a un ámbito y disposición fuera del patrón hasta el final del bloque que lo contiene o hasta que la siguiente coincidencia con éxito, lo que ocurra primero.

source: perlfaq4 Data Manipulation
es_es: perlfaq4 Manipulación de datos

source: $nread = sysread SOCKET, $buffer, $size;
es_es: $nread = sysread SOCKET, $búfer, $largo;

source: Here be dragons.
es_es: A partir de aquí, dragones.

source: Similarly during unpacking, "extra" bits are ignored.
es_es: Del mismo modo durante el desempaquetado, los bits "extra" se ignoran.

source: Since Perl 5.8.2 the ordering can be different even between different runs of Perl for security reasons (see L<perlsec/"Algorithmic Complexity Attacks">).
es_es: Desde Perl 5.8.2 la ordenación puede ser diferente incluso entre diferentes ejecuciones de Perl por razones de seguridad (ver L<perlsec/"Ataques por Complejidad Algorítmica">).

source: 0 "fred"
es_es: 0 "pedro"

source: And if the protocol you're using supports a way of letting the recipient know which character encoding you used, please help the receiving end by using that feature!
es_es: Y si el protocolo utilizado ofrece alguna manera de indicar al destinatario la codificación de caracteres utilizada, es muy recomendable hacerlo.

source: For example, in C<8 - 4 - 2>, subtraction is left associative so Perl evaluates the expression left to right.
es_es: Por ejemplo, en C<8 - 4 - 2>, la resta es asociativa a la izquierda así que Perl evalúa la expresión de izquierda a derecha.

source: If the PATTERN is delimited by bracketing quotes, the REPLACEMENT has its own pair of quotes, which may or may not be bracketing quotes, e.g., C<s(foo)(bar)> or C<< s<foo>/bar/ >>.
es_es: Si el PATRÓN está delimitado por paréntesis, corchetes, llaves, el REEMPLAZO tiene su propio par de delimitadores, que puede o no estar encerrado entre los mismos delimitadores, por ejemplo, C<s(foo)(bar)> o C<< s<foo>/bar/ >>.

source: X<%> X<remainder> X<modulo> X<mod>
es_es: X<%> X<remainder> X<modulo> X<mod> X<módulo> X<resto>

source: The two control characters ^D and ^Z, and the tokens __END__ and __DATA__ may be used to indicate the logical end of the script before the actual end of file.
es_es: Los dos caracteres de control ^D y ^Z, y los símbolos __END__ y __DATA__ pueden ser usados para indicar el fin lógico del programa antes del final real del archivo.

source: If multiple transliterations are given for a character, only the first one is used:
es_es: Si se dan múltiples transliteraciones para un carácter, sólo se utiliza el primero:

source: =item use Module VERSION LIST
es_es: =item use Módulo VERSIÓN LISTA

source: =head1 Q and A (or FAQ)
es_es: =head1 Preguntas y respuestas (o P+F)

source: http://www.cpan.org/ the Comprehensive Perl Archive
es_es: http://www.cpan.org/ Comprehensive Perl Archive Network

source: %c a character with the given number
es_es: %c un carácter del numero indicado

source: Precompilation of the pattern into an internal representation at the moment of qr() avoids a need to recompile the pattern every time a match C</$pat/> is attempted.
es_es: La precompilación del patrón en una representación interna en el momento de qr() evita la necesidad de recompilar el patrón cada vez que una coincidencia de C</$pat/> sea intentada.

source: chmod S_IRWXU|S_IRGRP|S_IXGRP|S_IROTH|S_IXOTH, @executables;
es_es: chmod S_IRWXU|S_IRGRP|S_IXGRP|S_IROTH|S_IXOTH, @ejecutables;

source: This construct is useful when you want to capture one of a number of alternative matches.
es_es: Esta construcción será útil cuando desea capturar una sola de una serie de alternativas.

source: my $thingie = shift;
es_es: my $cosita = shift;

source: ? "Error closing sort pipe: $!" : "Exit status $?
es_es: ? "Error cerrando la tubería con sort: $!" : "Estado de salida $?

source: perldbmfilter Perl DBM filters
es_es: perldbmfilter Filtros DBM

source: Do not use tell() (or other buffered I/O operations) on a filehandle that has been manipulated by sysread(), syswrite(), or sysseek().
es_es: No utilice tell() (u otras operaciones de E/S con búfer) en un identificador de archivo que ha sido manipulado con sysread(), syswrite() o sysseek().

source: With flock() support:
es_es: Con soporte de flock():
